### Terraform `plan` Failed for Workspace: `default`
<details><summary>Show Output</summary>

```
module.base.module.dns.aws_acm_certificate.cloudfront: Refreshing state... [id=arn:aws:acm:us-east-1:054479854625:certificate/433c172f-67fd-4ff2-b733-1669a1f5021b]
module.base.module.identity.aws_iam_group.internal_resource_controller: Refreshing state... [id=k2ss-internal-resource-controller]
module.base.module.identity.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::054479854625:oidc-provider/token.actions.githubusercontent.com]
module.base.module.server.aws_lightsail_instance.web: Refreshing state... [id=k2ss_instance]
module.base.module.dns.aws_route53_zone.main: Refreshing state... [id=Z07178352UCYZK53WIGH2]
module.base.module.server.aws_lightsail_static_ip.web: Refreshing state... [id=k2ss_staticip]
module.base.module.cdn.aws_cloudfront_distribution.sub_domains["gotea"]: Refreshing state... [id=E137KPPMJI96U9]
module.base.module.cdn.aws_cloudfront_distribution.sub_domains["gfdict"]: Refreshing state... [id=EO63QJ525LEYJ]
module.base.module.storage.aws_s3_bucket.internal_resource: Refreshing state... [id=k2ss-internal-resource]
module.base.module.cdn.aws_cloudfront_distribution.sub_domains["gotoeveryone"]: Refreshing state... [id=E2SFJ4592YIC2M]
module.base.module.dns.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:054479854625:certificate/3b6a35a9-c98e-4216-be33-41913be0a53a]
module.base.module.server.aws_lightsail_key_pair.web: Refreshing state... [id=k2ss_key]
module.base.module.cdn.aws_cloudfront_distribution.sub_domains["redmine"]: Refreshing state... [id=E19O8494UT8LD6]
module.base.module.identity.data.aws_iam_policy_document.github_actions_policy: Reading...
module.base.module.identity.data.aws_iam_policy_document.github_actions_policy: Read complete after 0s [id=2289236447]
module.base.module.dns.aws_route53_record.origins["gotoeveryone"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_gotoeveryone.origin.k2ss.info_A]
module.base.module.dns.aws_route53_record.origins["gotea"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_gotea.origin.k2ss.info_A]
module.base.module.dns.aws_route53_record.main["waaru.k2ss.info_A"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_waaru.k2ss.info_A]
module.base.module.dns.aws_route53_record.origins["gfdict"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_gfdict.origin.k2ss.info_A]
module.base.module.dns.aws_route53_record.origins["redmine"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_redmine.origin.k2ss.info_A]
module.base.module.dns.aws_route53_record.main["inishie.k2ss.info_A"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_inishie.k2ss.info_A]
module.base.module.dns.aws_route53_record.main["k2ss.info_TXT"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_k2ss.info_TXT]
module.base.module.dns.aws_route53_record.main["k2ss.info_MX"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_k2ss.info_MX]
module.base.module.dns.aws_route53_record.main["k2ss.info_A"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_k2ss.info_A]
module.base.module.dns.aws_route53_record.main["www.k2ss.info_A"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_www.k2ss.info_A]
module.base.module.dns.aws_route53_record.main["_dmarc.k2ss.info_TXT"]: Refreshing state... [id=Z07178352UCYZK53WIGH2__dmarc.k2ss.info_TXT]
module.base.module.dns.aws_route53_record.main["*.k2ss.info_A"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_*.k2ss.info_A]
module.base.module.dns.aws_route53_record.certificate["k2ss.info"]: Refreshing state... [id=Z07178352UCYZK53WIGH2__0a70eb3a1819848e966ab33e38b66b3a.k2ss.info._CNAME]
module.base.module.dns.aws_route53_record.certificate["*.k2ss.info"]: Refreshing state... [id=Z07178352UCYZK53WIGH2__0a70eb3a1819848e966ab33e38b66b3a.k2ss.info._CNAME]
module.base.module.server.aws_lightsail_static_ip_attachment.web: Refreshing state... [id=k2ss_staticip]
module.base.module.server.aws_lightsail_instance_public_ports.web: Refreshing state... [id=k2ss_instance-1421794143]
module.base.module.storage.aws_s3_bucket_versioning.internal_resource: Refreshing state... [id=k2ss-internal-resource]
module.base.module.storage.aws_s3_bucket_server_side_encryption_configuration.internal_resource: Refreshing state... [id=k2ss-internal-resource]
module.base.module.storage.aws_s3_bucket_public_access_block.internal_resource: Refreshing state... [id=k2ss-internal-resource]
module.base.module.identity.data.aws_iam_policy_document.internal_resource_controller_policy: Reading...
module.base.module.identity.data.aws_iam_policy_document.ci_policy: Reading...
module.base.module.identity.data.aws_iam_policy_document.internal_resource_controller_policy: Read complete after 0s [id=1362393909]
module.base.module.identity.data.aws_iam_policy_document.ci_policy: Read complete after 0s [id=3539625102]
module.base.module.identity.aws_iam_policy.internal_resource_controller_policy: Refreshing state... [id=arn:aws:iam::054479854625:policy/k2ss-internal-resource-controller-policy]
module.base.module.identity.aws_iam_policy.ci_policy: Refreshing state... [id=arn:aws:iam::054479854625:policy/k2ss-ci-policy]
module.base.module.identity.aws_iam_role.ci_role: Refreshing state... [id=k2ss-ci-role]
module.base.module.identity.aws_iam_group_policy_attachment.internal_resource_controller: Refreshing state... [id=k2ss-internal-resource-controller-20230618083439248600000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
😅/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.base.module.server.aws_lightsail_instance_public_ports.web must be replaced
😅/+ resource "aws_lightsail_instance_public_ports" "web" {
      ~ id            = "k2ss_instance-1421794143" -> (known after apply)
        # (1 unchanged attribute hidden)

      😅 port_info { # forces replacement
          😅 cidr_list_aliases = [
              😅 "lightsail-connect",
            ] -> null
          😅 cidrs             = [
              😅 "106.155.10.236/32",
            ] -> null
          😅 from_port         = 22 -> null
          😅 ipv6_cidrs        = [] -> null
          😅 protocol          = "tcp" -> null
          😅 to_port           = 22 -> null
        }
      😅 port_info { # forces replacement
          😅 cidr_list_aliases = [] -> null
          😅 cidrs             = [
              😅 "0.0.0.0/0",
            ] -> null
          😅 from_port         = 443 -> null
          😅 ipv6_cidrs        = [
              😅 "::/0",
            ] -> null
          😅 protocol          = "tcp" -> null
          😅 to_port           = 443 -> null
        }
      😅 port_info { # forces replacement
          😅 cidr_list_aliases = [] -> null
          😅 cidrs             = [
              😅 "0.0.0.0/0",
            ] -> null
          😅 from_port         = 80 -> null
          😅 ipv6_cidrs        = [
              😅 "::/0",
            ] -> null
          😅 protocol          = "tcp" -> null
          😅 to_port           = 80 -> null
        }
      + port_info { # forces replacement
          + cidr_list_aliases = (known after apply)
          + cidrs             = (known after apply)
          + from_port         = 443
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 443
        }
      + port_info { # forces replacement
          + cidr_list_aliases = (known after apply)
          + cidrs             = (known after apply)
          + from_port         = 80
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 80
        }
      + port_info { # forces replacement
          + cidr_list_aliases = [
              + "lightsail-connect",
            ]
          + cidrs             = [
              + "106.155.10.236/32",
            ]
          + from_port         = 22
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 22
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Error: reading Amazon CloudFront Distribution (E137KPPMJI96U9): AccessDenied: User: arn:aws:sts::054479854625:assumed-role/k2ss-ci-role/GitHubActions is not authorized to perform: cloudfront:GetDistribution on resource: arn:aws:cloudfront::054479854625:distribution/E137KPPMJI96U9 because no identity-based policy allows the cloudfront:GetDistribution action
│ 	status code: 403, request id: 98c9fab1-9f04-4856-aaf2-681145d458f2
│ 
│   with module.base.module.cdn.aws_cloudfront_distribution.sub_domains["gotea"],
│   on modules/cdn/cloudfront.tf line 2, in resource "aws_cloudfront_distribution" "sub_domains":
│    2: resource "aws_cloudfront_distribution" "sub_domains" {
│ 
╵
╷
│ Error: reading Amazon CloudFront Distribution (EO63QJ525LEYJ): AccessDenied: User: arn:aws:sts::054479854625:assumed-role/k2ss-ci-role/GitHubActions is not authorized to perform: cloudfront:GetDistribution on resource: arn:aws:cloudfront::054479854625:distribution/EO63QJ525LEYJ because no identity-based policy allows the cloudfront:GetDistribution action
│ 	status code: 403, request id: cdc0764a-322a-4dda-b2cc-4d8c998138d3
│ 
│   with module.base.module.cdn.aws_cloudfront_distribution.sub_domains["gfdict"],
│   on modules/cdn/cloudfront.tf line 2, in resource "aws_cloudfront_distribution" "sub_domains":
│    2: resource "aws_cloudfront_distribution" "sub_domains" {
│ 
╵
╷
│ Error: reading Amazon CloudFront Distribution (E19O8494UT8LD6): AccessDenied: User: arn:aws:sts::054479854625:assumed-role/k2ss-ci-role/GitHubActions is not authorized to perform: cloudfront:GetDistribution on resource: arn:aws:cloudfront::054479854625:distribution/E19O8494UT8LD6 because no identity-based policy allows the cloudfront:GetDistribution action
│ 	status code: 403, request id: c7882d3a-029e-40fc-be64-7211c94e1d0e
│ 
│   with module.base.module.cdn.aws_cloudfront_distribution.sub_domains["redmine"],
│   on modules/cdn/cloudfront.tf line 2, in resource "aws_cloudfront_distribution" "sub_domains":
│    2: resource "aws_cloudfront_distribution" "sub_domains" {
│ 
╵
╷
│ Error: reading Amazon CloudFront Distribution (E2SFJ4592YIC2M): AccessDenied: User: arn:aws:sts::054479854625:assumed-role/k2ss-ci-role/GitHubActions is not authorized to perform: cloudfront:GetDistribution on resource: arn:aws:cloudfront::054479854625:distribution/E2SFJ4592YIC2M because no identity-based policy allows the cloudfront:GetDistribution action
│ 	status code: 403, request id: ed1d4d88-9a2d-4b78-a970-f895ee9dbb42
│ 
│   with module.base.module.cdn.aws_cloudfront_distribution.sub_domains["gotoeveryone"],
│   on modules/cdn/cloudfront.tf line 2, in resource "aws_cloudfront_distribution" "sub_domains":
│    2: resource "aws_cloudfront_distribution" "sub_domains" {
│ 
╵
```
</details>